"""
練習題：升職加薪
"""

employees = {
    "王力宏": {
        "部門": "科技部",
        "工資": 3000,
        "級別": 1
    },
    "周杰倫": {
        "部門": "市場部",
        "工資": 5000,
        "級別": 2
    },
    "林俊傑": {
        "部門": "市場部",
        "工資": 7000,
        "級別": 3
    },
    "張學友": {
        "部門": "科技部",
        "工資": 4000,
        "級別": 1
    },
    "劉德華": {
        "部門": "市場部",
        "工資": 6000,
        "級別": 2
    },
}

print(f"全體員工當前信息如下：{employees}")

for name in employees:
    info = employees[name]
    if info["級別"] == 1:
        info["級別"] = 2  # 級別+1
        info["工資"] += 1000  # 工資+1000

print(f"全體員工級別為1的員工完成升職加薪操作，操作後：{employees}")